In [1]:
import pandas as pd

In [8]:
india_weather = {"city" : ["mumbai", "delhi", "banglore"],
                "tempreature" : [32,45,30],
                "humidity": [80,60,78]}
india_weather = pd.DataFrame(india_weather)

us_weather = {"city" : ["chichago", "orlando", "new york"],
                "tempreature" : [32,5,30],
                "humidity": [6,60,78]}
us_weather = pd.DataFrame(us_weather)

df = pd.concat([india_weather,us_weather], ignore_index=True)
df

       city  tempreature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  chichago           32         6
4   orlando            5        60
5  new york           30        78

In [9]:
df = pd.concat([india_weather,us_weather], keys=["india","us"])
df

             city  tempreature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  chichago           32         6
      1   orlando            5        60
      2  new york           30        78

In [13]:
df.loc["india"]

       city  tempreature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [28]:
s = pd.Series( ["humid","dry","rain","humid","dry","rain"], name = "event" )
s

0    humid
1      dry
2     rain
3    humid
4      dry
5     rain
Name: event, dtype: object

In [29]:
type(df)

pandas.core.frame.DataFrame

       city  tempreature  humidity  event
0    mumbai         32.0      80.0  humid
1     delhi         45.0      60.0    dry
2  banglore         30.0      78.0   rain
3       NaN          NaN       NaN  humid
4       NaN          NaN       NaN    dry
5       NaN          NaN       NaN   rain

In [33]:
india_weather

       city  tempreature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [34]:
d = pd.concat([india_weather,s],axis=1)
d

       city  tempreature  humidity  event
0    mumbai         32.0      80.0  humid
1     delhi         45.0      60.0    dry
2  banglore         30.0      78.0   rain
3       NaN          NaN       NaN  humid
4       NaN          NaN       NaN    dry
5       NaN          NaN       NaN   rain

In [42]:
india_wind = {"city" : ["delhi", "banglore"],
                "wind" : [32,45]}
india_wind = pd.DataFrame(india_wind)
e = pd.merge(india_weather,india_wind ,on = "city", how = "left")
e

       city  tempreature  humidity  wind
0    mumbai           32        80   NaN
1     delhi           45        60  32.0
2  banglore           30        78  45.0